Конфигурация/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходЗапрещен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/Пользователи/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтотОбъект.ВходЗапрещен И ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		ПроверяемыеРеквизиты.Добавить("АдресЭлектроннойПочты");
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоНовый() И Организация <> Ссылка.Организация Тогда
		
		МассивИскомыхСсылок = Новый Массив;
		МассивИскомыхСсылок.Добавить(Ссылка);
		
		МассивОбъектовМетаданных = Новый Массив;
		МассивОбъектовМетаданных.Добавить(Метаданные.Справочники.ГруппыПользователей.ТабличныеЧасти.Состав.Реквизиты.Пользователь);
		
		Если НайтиПоСсылкам(МассивИскомыхСсылок,,МассивОбъектовМетаданных).Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено менять организацию существующего пользователя, если на него есть ссылки!",, "Объект.Организация",, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЭтоНовый() 
	   И ЮрФизЛицо <> Ссылка.ЮрФизЛицо 
	   И ЗначениеЗаполнено(Справочники.Сотрудники.НайтиПоРеквизиту("Пользователь", Ссылка)) Тогда
	   
	   	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Пользователь (%1) используется в справочнике Сотрудники, изменение реквизита 'Юр физ лицо' запрещено", 
				ЭтотОбъект.Наименование), ЭтотОбъект,,, Отказ);
	КонецЕсли;
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
				
		Если ЭтотОбъект.Основной Тогда
			Если Не ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторПользователяИБ) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Основным может быть только пользователь, связанный с пользователем ИБ.",, "Объект.Основной",, Отказ);
			Иначе
				// проверим, что основной пользователь уникален среди пользователей с общим идентификатор ИБ
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
					|	Пользователи.Ссылка
					|ИЗ
					|	Справочник.Пользователи КАК Пользователи
					|ГДЕ
					|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ
					|	И Пользователи.Ссылка <> &Ссылка
					|	И Пользователи.Основной";
										
				Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ЭтотОбъект.ИдентификаторПользователяИБ);
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Основным пользователем для текущего пользователя ИБ уже выбран '" + Выборка.Ссылка + "'",, "Объект.Основной",, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		ВходЗапрещен = Истина;
	КонецЕсли;
		
КонецПроцедуры
